# Задача №3:
# Требуется вывести все целые степени двойки 
# (т.е. числа вида 2k), не превосходящие числа N.
# Пример:
# 10 -> 1 2 4 8

# 2*2 = 4
# 2*2*2 = 8

# a = 2**0
# print(a)
# b = 2**1
# print(b)
# c = 2**2
# print(c)
# d = 2**3
# print(d)

num = int(input('введите целое число: '))
i = 0
res = 2**i

while 2**i <= num:
    res = 2**i
    print(res)
    i = i + 1
